2018/coaching-journey.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-03 Thu 08:22 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>My Agile Coaching Journey</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>Draft Blog | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">My Agile Coaching Journey</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcefa2ba">Introduction</a></li>
<li><a href="#org4df8d6a">Overview</a></li>
<li><a href="#org525cde8">My Coaching Approach</a></li>
<li><a href="#org15a44f5">My Coaching Goals</a></li>
<li><a href="#orgb7fb460">Recent Learning</a>
<ul>
<li><a href="#org8d4724e">Team Dynamics</a></li>
<li><a href="#org64c2e4c">Innovation</a></li>
<li><a href="#orgac38100">Futurism</a></li>
</ul>
</li>
<li><a href="#org87090d9">Certification</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcefa2ba" class="outline-2">
<h2 id="orgcefa2ba">Introduction</h2>
<div class="outline-text-2" id="text-orgcefa2ba">
<p>
I have been using agile approaches and techniques for many years now, more years
than I care to remember and am now reflecting on what I have learnt, how I have
grown and where I want to go in the future.
</p>

<p>
This post is an opportunity for me to share my experience and learning through
that period. Hopefully it will be helpful, encouraging or maybe just interesting
to some people out there.
</p>
</div>
</div>

<div id="outline-container-org4df8d6a" class="outline-2">
<h2 id="org4df8d6a">Overview</h2>
<div class="outline-text-2" id="text-org4df8d6a">
<p>
My agile journey started in the early 2000s through XP. I began to see the value
of ‘turning up the good’ on practices in XP. I saw how agile principles such as
customer collaboration over contract negotiation was an improvement on our
previous waterfall / V-model approach.
</p>

<p>
I was introduced to Scrum at Nokia in about 2007. I went on the CSM course and
soon started valuing the framework that it provided in encouraging all
stakeholders to engage in a process of collaboration, incremental discovery and
continuous improvement.
</p>

<p>
I moved to Content Master in 2011 where I began my coaching journey properly.
Initially my approach was one of instruction and role modelling but I was keen
to help the team discover solutions for themselves and adapt the way they
collaborated with stakeholders but also see their effort rewarded through
validation by end users.
</p>

<p>
I then worked as a freelance developer for 4 years, primarily for one customer.
My main goal here, from a coaching perspective, was to try and help the owners
understand that timely user feedback was essential in ensuring success of the
project and reduce wasted effort. This appeared to fall on deaf ears.
</p>

<p>
I moved to MASS in 2016 where I began coaching across several teams and
individuals, including senior management to help them understand why and how an
agile approach (particularly Scrum) could help them meet the challenges they
faced.
</p>

<p>
While at MASS I was responsible for creating and running a product development
capability for one of our customers. It was here that the penny dropped and the
coaching component of ‘agile coaching’ became better understood, appreciated and
practiced. 
</p>

<p>
Since then I have been actively coaching in the role of innovation lead.
</p>

<p>
I am as keen to learn as I am to help people learn. The desire for adventure and
the embracing of the unknown is something that has been with me from a young
age. This is something that drives me towards embracing new ways of thinking,
approaches and input from disciplines and activity outside the normal sphere of
agile practices, such as art, poetry and philosophy. I don’t pretend to be an
expert in any of these but believe that anything that expresses the human
condition is valuable input to coaching.
</p>

<p>
I often talk of my weakness in wanting to please people, while this has caused
me problems with over commitment at times, I have now come to realise the value
of that when it comes to empathy with the coachee. While my listening skills
could always be improved, this is something that has become more apparent and
encouraging to me.
</p>
</div>
</div>

<div id="outline-container-org525cde8" class="outline-2">
<h2 id="org525cde8">My Coaching Approach</h2>
<div class="outline-text-2" id="text-org525cde8">
<p>
Coaching is still a journey of discovery for me. I am actively coaching,
learning as I go and hoping that I can help the teams and individuals I work
with find success.
</p>

<p>
In my role of innovation lead, I take a coaching stance to help the company,
departments, teams and individuals understand how they can contribute to the
growth of the company through innovation and solve the problems they see from
their own unique perspective.
</p>

<p>
My experience in agile approaches, lean thinking and validated learning help in
this role, but I see myself primarily as an enabler, encourager and role model
rather than a commander, authority or even expert.
</p>

<p>
I am hungry to learn about different fields that can contribute to development
of highly successful and rewarding companies and teams and incorporate that into
leading and coaching wherever I can.
</p>

<p>
I receive coaching from an experienced coach as a means to help me develop, but also for
the coaching role model it provides, to help me develop my coaching skills and
hone my coaching toolset.
</p>

<p>
In the spirit of the agile manifesto I believe the things on the right have
value in coaching but that those on the left have more value:
</p>

<ul class="org-ul">
<li>Trusting people over trusting techniques.</li>
<li>Looking for good over correcting behaviour.</li>
<li>Powerful questions over providing solutions.</li>
<li>Building independence over providing a safety net.</li>
</ul>
</div>
</div>

<div id="outline-container-org15a44f5" class="outline-2">
<h2 id="org15a44f5">My Coaching Goals</h2>
<div class="outline-text-2" id="text-org15a44f5">
<p>
I continually need to remember to develop my listening skills in order to
empathise and understand others better in a coaching scenario.
</p>

<p>
I also need to develop my skills, toolsets and confidence in coaching senior
management, particularly in respect to innovation.
</p>

<p>
Another aspect of my future learning is to look for ways in which I can provide
input into education. I am already involved with a local school, from a
technical as well as a coaching/mentoring perspective, but believe there is a
lot that can be learnt from agile principles that apply within education.
</p>
</div>
</div>

<div id="outline-container-orgb7fb460" class="outline-2">
<h2 id="orgb7fb460">Recent Learning</h2>
<div class="outline-text-2" id="text-orgb7fb460">
</div><div id="outline-container-org8d4724e" class="outline-3">
<h3 id="org8d4724e">Team Dynamics</h3>
<div class="outline-text-3" id="text-org8d4724e">
<p>
My role is often within a team that is diverse, geographically split, has
individuals who are in the team as a secondary function and have very different
skills and backgrounds. 
</p>

<p>
I have been reading about team dynamics through books such as Coaching Agile
Teams, Peopleware and 5 Dysfunctions of a team.
</p>

<p>
It has helped me not only help guide teams to think about their environment and
how it contributes to their effectiveness, but also to understand different
characters at play and different relationships, through battle mapping.
</p>

<p>
I have become more aware that I do try to please people, but also accept that
perhaps this helps me be more empathic towards people and this helps me be more
effective as a coach.
</p>

<p>
I have also now started to help teams see that low levels of conflict can be
beneficial to being an effective team but that trust is absolutely essential to
achieving this.
</p>
</div>
</div>

<div id="outline-container-org64c2e4c" class="outline-3">
<h3 id="org64c2e4c">Innovation</h3>
<div class="outline-text-3" id="text-org64c2e4c">
<p>
One of my growing responsibilities is to provide coaching around innovation.
I have spent time studying theory, frameworks and techniques through reading
and conversations with others.
</p>


<p>
This has given me a perspective of learning as all important within an
organisation and that clearly applies to the PDCA cycle, agile approaches and
innovation. I can better help people identify opportunities to maximise learning
through feedback and see learning as key to successful agile delivery. (4th
Generation R&amp;D)
</p>

<p>
I am also discovering new and holistic approaches to innovation that ensure
that all aspects of the organisation contribute to innovation and growth,
this expands the principle of cross function and self organising teams into
the wider organisation. This is helping me very much involve everyone in the
innovation conversation and ensuring that the organisation as a whole can
identify and execute innovation on a wider scale. (10 types of innovation,
Business Model Generation).
</p>
</div>
</div>

<div id="outline-container-orgac38100" class="outline-3">
<h3 id="orgac38100">Futurism</h3>
<div class="outline-text-3" id="text-orgac38100">
<p>
Futurism was an art movement of the early 20th century that called for the
rejection of the past and the relentless march to modernity. It was an
artistic movement that emphasised movement and motion and dynamism. It
embraced modern city life, rejected stasis.
</p>

<p>
While it is extreme and it arguably contributed to some pretty extreme
consequences throughout Europe in the 20th century, it portrays the
excitement of the unknown, the future and change, which is the complex world
where agile approaches thrive:
</p>

<p>
“I appeal to the young, to those who are thirsty for the new, the actual, the
lively. They follow me, faithful and fearless, along the roads of the future,
gloriously preceded by my, by our, intrepid brothers, the Futurist poets and
painters, beautiful with violence, daring with rebellion and luminous with
the animation of genius.”
</p>

<p>
While, that is not my approach to coaching, I do like to aspects of other
fields and how they relate to coaching, agile approaches, innovation and
other aspects of what I do professionally. Bringing those aspects into
conversations, discussions and debate makes the work place a richer place.
</p>
</div>
</div>
</div>

<div id="outline-container-org87090d9" class="outline-2">
<h2 id="org87090d9">Certification</h2>
<div class="outline-text-2" id="text-org87090d9">
<p>
The journey is always ongoing, I feel the potential for learning is
continually expanding. As part of my journey I have applied for Certified Team
Coach.
</p>

<p>
I believe certification is primarily a sign of professional commitment to and
appreciation of a particular discipline or approach. It is certainly not a
sign of ‘having arrived’ but rather a recognition of a particular phase along
a personal development journey.
</p>

<p>
Although the primary reasons are personal satisfaction, there is also a need
for agile coaches amongst our customer base and the certification provides
some degree of confidence in an individual to be competent and experienced.
</p>

<p>
Also, the process of certification enables me to focus on my own development
as a coach, where my strengths and weaknesses are and where I need to focus my
efforts in improving, but also what I can skills and tools I can leverage to
best help others succeed.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2018-05-03 Thu 08:22</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
